MikroElektronika/core_packages/ARM/gcc_clang/startup/nxp/MKV56F1M0VMD24.s
    .weak      ENC_INDEX_IRQHandler
    .thumb_set ENC_INDEX_IRQHandler,Default_Handler

    .weak      CMP2_IRQHandler
    .thumb_set CMP2_IRQHandler,Default_Handler

    .weak      FTM3_IRQHandler
    .thumb_set FTM3_IRQHandler,Default_Handler

    .weak      Reserved88_IRQHandler
    .thumb_set Reserved88_IRQHandler,Default_Handler

    .weak      HSADC0_CCB_IRQHandler
    .thumb_set HSADC0_CCB_IRQHandler,Default_Handler

    .weak      HSADC1_CCA_IRQHandler
    .thumb_set HSADC1_CCA_IRQHandler,Default_Handler

    .weak      CAN0_ORed_Message_buffer_IRQHandler
    .thumb_set CAN0_ORed_Message_buffer_IRQHandler,Default_Handler

    .weak      CAN0_Bus_Off_IRQHandler
    .thumb_set CAN0_Bus_Off_IRQHandler,Default_Handler

    .weak      CAN0_Error_IRQHandler
    .thumb_set CAN0_Error_IRQHandler,Default_Handler

    .weak      CAN0_Tx_Warning_IRQHandler
    .thumb_set CAN0_Tx_Warning_IRQHandler,Default_Handler

    .weak      CAN0_Rx_Warning_IRQHandler
    .thumb_set CAN0_Rx_Warning_IRQHandler,Default_Handler

    .weak      CAN0_Wake_Up_IRQHandler
    .thumb_set CAN0_Wake_Up_IRQHandler,Default_Handler

    .weak      PWM0_CMP0_IRQHandler
    .thumb_set PWM0_CMP0_IRQHandler,Default_Handler

    .weak      PWM0_RELOAD0_IRQHandler
    .thumb_set PWM0_RELOAD0_IRQHandler,Default_Handler

    .weak      PWM0_CMP1_IRQHandler
    .thumb_set PWM0_CMP1_IRQHandler,Default_Handler

    .weak      PWM0_RELOAD1_IRQHandler
    .thumb_set PWM0_RELOAD1_IRQHandler,Default_Handler

    .weak      PWM0_CMP2_IRQHandler
    .thumb_set PWM0_CMP2_IRQHandler,Default_Handler

    .weak      PWM0_RELOAD2_IRQHandler
    .thumb_set PWM0_RELOAD2_IRQHandler,Default_Handler

    .weak      PWM0_CMP3_IRQHandler
    .thumb_set PWM0_CMP3_IRQHandler,Default_Handler

    .weak      PWM0_RELOAD3_IRQHandler
    .thumb_set PWM0_RELOAD3_IRQHandler,Default_Handler

    .weak      PWM0_CAP_IRQHandler
    .thumb_set PWM0_CAP_IRQHandler,Default_Handler

    .weak      PWM0_RERR_IRQHandler
    .thumb_set PWM0_RERR_IRQHandler,Default_Handler

    .weak      PWM0_FAULT_IRQHandler
    .thumb_set PWM0_FAULT_IRQHandler,Default_Handler

    .weak      CMP3_IRQHandler
    .thumb_set CMP3_IRQHandler,Default_Handler

    .weak      HSADC1_CCB_IRQHandler
    .thumb_set HSADC1_CCB_IRQHandler,Default_Handler

    .weak      CAN1_ORed_Message_buffer_IRQHandler
    .thumb_set CAN1_ORed_Message_buffer_IRQHandler,Default_Handler

    .weak      CAN1_Bus_Off_IRQHandler
    .thumb_set CAN1_Bus_Off_IRQHandler,Default_Handler

    .weak      CAN1_Error_IRQHandler
    .thumb_set CAN1_Error_IRQHandler,Default_Handler

    .weak      CAN1_Tx_Warning_IRQHandler
    .thumb_set CAN1_Tx_Warning_IRQHandler,Default_Handler

    .weak      CAN1_Rx_Warning_IRQHandler
    .thumb_set CAN1_Rx_Warning_IRQHandler,Default_Handler

    .weak      CAN1_Wake_Up_IRQHandler
    .thumb_set CAN1_Wake_Up_IRQHandler,Default_Handler

    .weak      Reserved116_IRQHandler
    .thumb_set Reserved116_IRQHandler,Default_Handler

    .weak      Reserved117_IRQHandler
    .thumb_set Reserved117_IRQHandler,Default_Handler

    .weak      Reserved118_IRQHandler
    .thumb_set Reserved118_IRQHandler,Default_Handler

    .weak      Reserved119_IRQHandler
    .thumb_set Reserved119_IRQHandler,Default_Handler

    .weak      PWM1_CMP0_IRQHandler
    .thumb_set PWM1_CMP0_IRQHandler,Default_Handler

    .weak      PWM1_RELOAD0_IRQHandler
    .thumb_set PWM1_RELOAD0_IRQHandler,Default_Handler

    .weak      PWM1_CMP1_IRQHandler
    .thumb_set PWM1_CMP1_IRQHandler,Default_Handler

    .weak      PWM1_RELOAD1_IRQHandler
    .thumb_set PWM1_RELOAD1_IRQHandler,Default_Handler

    .weak      PWM1_CMP2_IRQHandler
    .thumb_set PWM1_CMP2_IRQHandler,Default_Handler

    .weak      PWM1_RELOAD2_IRQHandler
    .thumb_set PWM1_RELOAD2_IRQHandler,Default_Handler

    .weak      PWM1_CMP3_IRQHandler
    .thumb_set PWM1_CMP3_IRQHandler,Default_Handler

    .weak      PWM1_RELOAD3_IRQHandler
    .thumb_set PWM1_RELOAD3_IRQHandler,Default_Handler

    .weak      PWM1_CAP_IRQHandler
    .thumb_set PWM1_CAP_IRQHandler,Default_Handler

    .weak      PWM1_RERR_IRQHandler
    .thumb_set PWM1_RERR_IRQHandler,Default_Handler

    .weak      PWM1_FAULT_IRQHandler
    .thumb_set PWM1_FAULT_IRQHandler,Default_Handler

    .weak      Reserved131_IRQHandler
    .thumb_set Reserved131_IRQHandler,Default_Handler

    .weak      Reserved132_IRQHandler
    .thumb_set Reserved132_IRQHandler,Default_Handler

    .weak      Reserved133_IRQHandler
    .thumb_set Reserved133_IRQHandler,Default_Handler

    .weak      Reserved134_IRQHandler
    .thumb_set Reserved134_IRQHandler,Default_Handler

    .weak      Reserved135_IRQHandler
    .thumb_set Reserved135_IRQHandler,Default_Handler

    .weak      Reserved136_IRQHandler
    .thumb_set Reserved136_IRQHandler,Default_Handler
